print("DEBUG: executing hendlers.py FROM THIS")
print(__file__)
from aiogram.filters import CommandStart
from aiogram import Router, F
from aiogram.fsm.state import State, StatesGroup
from aiogram.fsm.context import FSMContext

from aiogram.types import (
    Message,
    InlineKeyboardMarkup,
    InlineKeyboardButton,
    CallbackQuery,
    FSInputFile,
)

import app.keyboards as kb

import os
import base64
import cv2

os.environ["TF_CPP_MIN_LOG_LEVEL"] = "2"

import tensorflow
import numpy as np
import io
from PIL import Image as PImage

router = Router()

ecoMarksImage = [
    "app/media/1.jpg",
    "app/media/2.jpg",
    "app/media/3.png",
    "app/media/4.png",
    "app/media/5.png",
    "app/media/6.png",
    "app/media/7.png",
    "app/media/8.jpg",
    "app/media/9.png",
]

ecoMarks = [
    "Біорозкладний",
    "Блакитний ангел (Blue Angel)",
    "Європейський екомаркувальний знак (EU Ecolabel)",
    "Сертифікат FSC",
    "Скандинавський лебідь (Nordic Swan)",
    "Органічний продукт",
    "Органічний продукт України",
    "Перероблюваний",
    "Зелений журавлик",
]

Info = [
    "Таке маркування свідчить, що товар або його упаковка з часом розкладаються природним шляхом (бактеріями, грибами, іншими живими організмами), не завдаючи шкоди довкіллю. Наприклад, біопакети чи одноразовий посуд із кукурудзяного крохмалю.",
    "Перше у світі екомаркування, створене в Німеччині ще в 1978 році. Його дають товарам, які не шкодять довкіллю, зокрема побутовій хімії, паперовій продукції, електроніці. Це знак, що продукція безпечніша для природи у порівнянні з аналогами.",
    "Офіційний екологічний знак Європейського Союзу. Його дають товарам і послугам, які відповідають високим стандартам якості та екологічності на всіх етапах життєвого циклу: від виробництва до утилізації. Це маркування визнане в усіх країнах ЄС.",
    "Знак Лісової опікунської ради (Forest Stewardship Council). Він гарантує, що деревина чи папір виготовлені з лісів, де вирубка відбувається відповідально: висаджуються нові дерева, зберігається біорізноманіття і враховуються права місцевих громад.",
    "Одне з найвідоміших у світі екомаркувань, що діє у країнах Північної Європи (Швеція, Норвегія, Фінляндія, Данія, Ісландія). Гарантує, що продукція відповідає жорстким екологічним вимогам: низький вплив на природу, безпечність для здоров’я людини та контроль якості на всіх етапах виробництва.",
    "Це маркування показує, що продукт вирощений без використання хімічних добрив, пестицидів, ГМО чи синтетичних добавок. Воно поширене у світі на продуктах харчування, косметиці та текстилі.",
    "Національне українське маркування для органічних продуктів. Його дають товарам, що відповідають європейським стандартам органічного виробництва, але сертифікацію проходять саме в Україні. Це допомагає споживачам впізнавати натуральні та безпечні продукти на ринку.",
    "Показує, що упаковку або товар можна здати на переробку. Це допомагає зменшити кількість відходів та повторно використовувати ресурси. Зазвичай маркування має вигляд трикутника зі стрілок.",
    "Українське добровільне екологічне маркування. Його отримують товари, що відповідають екологічним стандартам: безпечні у використанні, виготовлені з мінімальним впливом на природу, можуть перероблятися. Це знак довіри для споживачів, які хочуть обирати більш екологічні товари на українському ринку.",
]

models = tensorflow.keras.models.load_model(
    "app/media/eco_marks_model.keras", compile=False
)


class Register(StatesGroup):
    photo = State()


@router.callback_query(
    F.data.in_(
        [
            "next0",
            "next1",
            "next2",
            "next3",
            "next4",
            "next5",
            "next6",
            "next7",
            "next8",
            "next9",
        ]
    )
)
async def callback(callback: CallbackQuery):
    index = int(callback.data.replace("next", ""))
    await callback.message.answer(text=f"{ecoMarks[index]}")
    await callback.message.answer(text=f"{Info[index]}")


@router.message(CommandStart())
async def start(message: Message):
    await message.answer(
        "👋 Вітаю!\nЦе бот, який допоможе розпізнати екологічні маркування на упаковках 🌍\n📸 Просто зроби фото логотипу чи знаку на товарі — і бот підкаже:\n✅ що це за екомаркування\n✅ що воно означає\n✅ як правильно поводитися з цим товаром або упаковкою\n\nТак ти зможеш швидко дізнатися, чи можна упаковку переробити, чи товар є органічним, чи він відповідає міжнародним екостандартам 🌿♻️\n\n💡 Обирай свідомо — роби свій внесок у збереження природи!",
        reply_markup=kb.main,
    )


@router.message(F.text == "🌿 Дізнатися більше про екомаркування")
async def Information(message: Message):
    await message.answer(
        "🌱 Екомаркування — це спеціальні знаки на товарах і упаковках, які підтверджують, що продукція є більш безпечною для довкілля та людини. Вони вказують, що товар виготовлений з дотриманням екологічних стандартів, може бути перероблений, має менший вуглецевий слід або ж виготовлений із натуральних матеріалів.\n\nЕкомаркування допомагає споживачам робити свідомий вибір: обираючи товари з такими позначками, людина підтримує компанії, які піклуються про довкілля. Водночас воно мотивує виробників зменшувати шкоду природі, впроваджувати нові технології та використовувати ресурси більш відповідально.\n\nНайпоширеніші типи екомаркувань:\n\n♻️ Переробка та повторне використання — знак показує, що упаковка чи матеріал підлягають вторинній переробці або виготовлені з переробленої сировини.\n\n🌿 Органічність — продукція вирощена без хімічних добрив, пестицидів чи ГМО (наприклад, Organic або Organic UA).\n\n🌍 Міжнародні стандарти — такі як EU Ecolabel, Nordic Swan, Blue Angel, які гарантують екологічність на різних етапах виробництва.\n\n🌳 Сталий розвиток — наприклад, FSC, що підтверджує відповідальне використання лісів.\n\nТаким чином, екомаркування — це провідник між виробником і покупцем, який дозволяє зрозуміти, наскільки товар дружній до природи. Обираючи продукцію з екознаками, ми не лише дбаємо про власне здоров’я, а й робимо внесок у збереження довкілля для майбутніх поколінь.",
        reply_markup=kb.main,
        parse_mode="html",
    )


@router.message(F.text == "♻️ Обрати екомаркування")
async def TakePhoto(message: Message):
    for i in range(0, 9):
        image = FSInputFile(ecoMarksImage[i])
        text = ecoMarks[i]
        k = int(i) + 1
        keyboard = InlineKeyboardMarkup(
            inline_keyboard=[
                [InlineKeyboardButton(text=f"Це фото", callback_data=f"next{i}")]
            ]
        )
        await message.answer_photo(
            photo=image,
            caption=text,
            parse_mode="HTML",
            reply_markup=keyboard,
        )
    await message.answer("Оберіть картинку")


@router.message(F.text == "📸 Зробити фото маркування")
async def register_name(message: Message, state: FSMContext):
    await state.set_state(Register.photo)
    await message.answer("Відправте фото")


@router.message(Register.photo, F.photo)
async def register_city(message: Message, state: FSMContext):
    await message.answer("Аналізую фото...")
    photo = message.photo[-1]

    # завантажуємо файл з Telegram
    file = await message.bot.get_file(photo.file_id)
    downloaded_file = await message.bot.download_file(file.file_path)
    image_data = downloaded_file.read()

    # відкриваємо картинку
    imgpath = PImage.open(io.BytesIO(image_data)).convert("RGB")
    loadedImages = np.asarray(imgpath)
    resized_image = cv2.resize(loadedImages, (240, 240))
    loadedImages = resized_image / 255.0
    y = np.expand_dims(loadedImages, axis=0)

    # передбачення
    res = models.predict(y)

    all_parametrs = list(res[0])

    sorted_list = []
    for n in range(5):
        max_val = max(all_parametrs)
        max_idx = all_parametrs.index(max_val)
        sorted_list.append(max_val)
        sorted_list.append(max_idx)
        all_parametrs[max_idx] = 0

    data = {
        "first": sorted_list[0],
        "firstIndex": sorted_list[1],
        "second": sorted_list[2],
        "secondIndex": sorted_list[3],
        "third": sorted_list[4],
        "thirdIndex": sorted_list[5],
        "fourth": sorted_list[6],
        "fourthIndex": sorted_list[7],
        "fifth": sorted_list[8],
        "fifthIndex": sorted_list[9],
    }

    print(data)
    await message.answer(f"{ecoMarks[sorted_list[1]]}")
    await message.answer(f"{Info[sorted_list[1]]}")
    await state.clear()

